
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/shimota-dev/aws-ecs-terraform/actions/runs/4775924095)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-068e23561f8f078c6]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-008e5722bf30b8142]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b187818db468838e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c2c430090da69c66]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-098322cf3202fb0ac]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-033643a06f76e4b0c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0846e4a017b57f8f5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07de421700351d7bf]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ca4f15a04c6d08c9]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-098d91b31f5e3673c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b50b2476369bbd39]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0feb4c9a6e80d8e33]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-043da24431e45029f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0057ecae1b13d1a40]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c96c0c5544b9b515]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0645b77e410c9fc4c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05c2ce13ee4a00ce3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-024def2a266365ea4]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-012e09e94b920d8cd]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07de421700351d7bf1080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-065f54d280fda9f9d]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-098d91b31f5e3673c1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-033643a06f76e4b0c1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-008e5722bf30b8142"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-008e5722bf30b8142"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.alb: Creating...
aws_security_group.ecs: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-0be0c682e474673e2]
aws_security_group.alb: Creation complete after 4s [id=sg-018d694f340c980d4]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-2223750602]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"f7a5445a924f6b25752a9ebdff1363920b5c1676","Vars":{},"WorkflowName":"Terraform"} -->